{"config": {"name": "model_5", "input_layers": [["input_5", 0, 0]], "layers": [{"name": "input_5", "config": {"dtype": "float32", "batch_input_shape": [null, 70], "name": "input_5", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_5", "config": {"name": "embedding_5", "dtype": "float32", "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "output_dim": 70, "activity_regularizer": null, "batch_input_shape": [null, 70], "trainable": true, "input_dim": 30174, "input_length": 70, "embeddings_constraint": null, "mask_zero": false}, "class_name": "Embedding", "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "dropout_5", "config": {"name": "dropout_5", "rate": 0.3, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "bidirectional_5", "config": {"name": "bidirectional_5", "merge_mode": "concat", "trainable": true, "layer": {"config": {"units": 100, "name": "lstm_5", "return_state": false, "return_sequences": true, "recurrent_dropout": 0.2, "recurrent_constraint": null, "use_bias": true, "activation": "tanh", "stateful": false, "implementation": 1, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "unroll": false, "recurrent_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "kernel_regularizer": null, "go_backwards": false, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}}, "class_name": "Bidirectional", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "time_distributed_5", "config": {"name": "time_distributed_5", "trainable": true, "layer": {"config": {"name": "dense_5", "units": 18, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "use_bias": true, "activation": "softmax"}, "class_name": "Dense"}}, "class_name": "TimeDistributed", "inbound_nodes": [[["bidirectional_5", 0, 0, {}]]]}], "output_layers": [["time_distributed_5", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.3"}